---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyInteger
source: html/881f3822-5fc9-da1e-9c35-e0dd39e9343d.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyInteger

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyInteger : AssetProperty
```